# panda Ashar 19,2079

In [1]:
try:
    b=open('data.csv','x')
    b.close()
except: 
    pass

In [5]:
import pandas as pd 
df=pd.read_csv('data.csv')  # to read data in csv file we use read_csv("filename.csv")
print(df)

   S.N       Name  Age        Add       Phone
0    1        Ram   15  Kathmandu  9812034567
1    2      Dilip   50    Kailali  9860200841
2    3  Khagendra   26   Lalitpur  9849004567
3    4      Sabin   25      Banke  9846034567
4    5     Malati   40       Dang   981111111
5    6     Ganesh   25  Mehelkuna  9840312345

In [9]:
import pandas as pd
dc=pd.read_csv('data.csv')
print(dc.head(2))       # return data from the top of the csv file

   S.N   Name  Age        Add       Phone
0    1    Ram   15  Kathmandu  9812034567
1    2  Dilip   50    Kailali  9860200841

In [8]:
import pandas as pd
dc=pd.read_csv('data.csv')
print(dc.tail(3))   #return data from bottom of the csv file

   S.N    Name  Age        Add       Phone
3    4   Sabin   25      Banke  9846034567
4    5  Malati   40       Dang   981111111
5    6  Ganesh   25  Mehelkuna  9840312345

In [12]:
import pandas as p
df=pd.read_csv('data.csv',index_col='S.N') #specifies index
df

          Name  Age        Add       Phone
S.N
1          Ram   15  Kathmandu  9812034567
2        Dilip   50    Kailali  9860200841
3    Khagendra   26   Lalitpur  9849004567
4        Sabin   25      Banke  9846034567
5       Malati   40       Dang   981111111
6       Ganesh   25  Mehelkuna  9840312345

In [26]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='S.N')
df.iloc[2:5]

          Name  Age       Add       Phone
S.N
3    Khagendra   26  Lalitpur  9849004567
4        Sabin   25     Banke  9846034567
5       Malati   40      Dang   981111111

In [15]:
import pandas as pd
dc=pd.read_csv('data.csv',index_col='S.N',usecols=['S.N','Name','Phone'])
dc

          Name       Phone
S.N
1          Ram  9812034567
2        Dilip  9860200841
3    Khagendra  9849004567
4        Sabin  9846034567
5       Malati   981111111
6       Ganesh  9840312345

In [16]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='S.N')
df['Add']

S.N
1    Kathmandu
2      Kailali
3     Lalitpur
4        Banke
5         Dang
6    Mehelkuna
Name: Add, dtype: object

In [18]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='S.N')
df['Add']==("Kathmandu")

S.N
1     True
2    False
3    False
4    False
5    False
6    False
Name: Add, dtype: bool

In [19]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='S.N')
df[df['Add']=='Kathmandu']  #for filtering the data according to given condition

    Name  Age        Add       Phone
S.N
1    Ram   15  Kathmandu  9812034567

In [21]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='S.N')
df[(df['Age']>30) & (df['Add']=='Kailali')]

      Name  Age      Add       Phone
S.N
2    Dilip   50  Kailali  9860200841

In [22]:
# to save the filtered file in new file we use data.to_csv() fucntion
import pandas as pd
df=pd.read_csv('data.csv',index_col='S.N')
data=df[(df['Age']>30) & (df['Add']=='Kailali')]
data.to_csv('new_data.csv')
data

      Name  Age      Add       Phone
S.N
2    Dilip   50  Kailali  9860200841

In [23]:
data={'name':['Ram','Shyam','Hari'],
'age':[43,56,67],
'add':['Kathmandu','Bhaktapur','Lalitpur']}
df=pd.DataFrame(data)
df.to_csv('new_data1.csv')
df

    name  age        add
0    Ram   43  Kathmandu
1  Shyam   56  Bhaktapur
2   Hari   67   Lalitpur